[{"class-name":"Adult Pottery","description":"Students will make hand build slab vases, teapots sets, press mold, imprinting boxes, along with painting with slip, carving, and inlay design. They will also keep throwing on the pottery wheels to make dinner ware like bowls, plates, saucers, pitchers, sugar jar with lid, etc. No experience needed. Just come to exercise your imagination through the creative process. Your first bag of clay is included in the class fee.","category":"visual arts and crafts","age":"18+","age-category":"adults","instructor":"Jocelyn Yee","img":"adult-pottery.png","date-1":"1/19-3/9","days-1":"Tuesday","time-1":"10-12:30 pm","cost-1":"195"},{"class-name":"Adult Pottery - Beginner","description":"In this beginner pottery class students will discover the beauty of both hand-building and wheel-throwing techniques. Students will learn how to make bowels, cups, plates, and vases, alter the shape from wheel thrown pieces, and decorate their pieces with color slip design and glaze. Students will each receive a free bag of clay and free studio time during the quarter.","category":"visual arts and crafts","age":"18+","age-category":"adults","instructor":"Jocelyn Yee","img":"adult-pottery.png","date-1":"1/19-3/8","days-1":"Tuesday","time-1":"6:30-9:00 pm","cost-1":"195"},{"class-name":"Adult Pottery - Intermediate","description":"This course is for students who already have the basic throwing skills and wants to try larger forms on wheel or hand-built sculptures. We will continue working with large wheel throwing pieces, combined with hand-built sculpture, double-wall pot, upside-down plate, and more. Students will learn to use under- glaze, oxide paint, and mocha diffusion surface decoration to finish their clay projects. Student will each receive a free bag of clay and access to studio during the quarter. Sign up early.","category":"visual arts and crafts","age":"18+","age-category":"adults","instructor":"Jocelyn Yee","img":"adult-pottery.png","date-1":"1/20-3/9","days-1":"Wednesday","time-1":"6:30-9:00 pm","cost-1":"196"},{"class-name":"Circuit Training Boot Camp","description":"Get moving in one of our many fitness classes, including but not limited to boot camps, weight lifting, Intro to personal fitness, circuit training and a variety of dance fitness courses. Boot-camp is a combination of strength, cardio, muscle endurance, flexibility, core, and functional movement patterns. You get EVERYTHING you need! These boot camps are designed in a way to be different all the time, and push our participants harder than they'd push themselves. We want to keep you guessing - and challenge you differently every class! Workouts formats will consist of running, HIIT (high-intensity interval training), bodyweight, stations, and more. Modifications available in this positive & supportive environment. We want you to have tons of fun – but please be prepared for some high i Get fit at the boathouse! Be healthy! Have more energy! This 'on-land' class is designed for you! No boating experience is necessary. Increase your stamina, strengthen your core, tone your muscles, and increase your flexibility. This conditioning course will develop your fitness by using free weights, physio-balls, rowing machines, and some yoga. Each class is one hour - twice a week.","category":"fitness health and wellness","age":"18+","age-category":"adults","img":"circuit-training.png","date-1":"2/2-2/25","days-1":"Tuesday/Thursday","time-1":"7-8 am","cost-1":"88","date-2":"2/6-2/27","days-2":"Saturday","time-2":"7-8 am","cost-2":"88","date-3":"3/1-3/31","days-3":"Tuesday/Thursday","time-3":"7-8 am","cost-3":"88","date-4":"3/5-3/26","days-4":"Sat","time-4":"7-8 am","cost-4":"88"},{"class-name":"Creative Dance","description":"Through fantasy and games, boys and girls learn basic movement skills and dance vocabulary. Children will be encouraged to work as a team and make individual choices in their expressive movement.","category":"performing arts and dance","age":"2-4","age-category":"tots","img":"creative-dance.png","date-1":"1/23-2/20","days-1":"Saturday","time-1":"9:15-10 am","cost-1":"60","date-2":"2/27-3/26","days-2":"Saturday","time-2":"9:15-10 am","cost-2":"60"},{"class-name":"Hatha Yoga","description":"Gentle Hatha Yoga for beginners and students seeking a nurturing, slower-paced class. Uniting breath and alignment, students will cultivate strength, flexibility, and relaxation. Please bring your own mat and water bottle.","category":"fitness health and wellness","age":"18+","age-category":"adults","instructor":"Natalie Phillips","img":"hatha-yoga.png","date-1":"1/12-2/9","days-1":"Tuesday","time-1":"11:30 am-12:30 pm","cost-1":"55","date-2":"2/16-3/15","days-2":"Tuesday","time-2":"11:30 am-12:30 pm","cost-2":"55"},{"class-name":"Hawaiian Hula Dance","description":"Learn dance steps, hand movements, language, and customs in a welcoming, creative environment. Fit them together in the telling of a story. Fun, low impact exercise!","category":"performing arts and dance","age":"14+","age-category":"adults","instructor":"Avery Douglas","img":"hula-dance.png","date-1":"1/5-1/26","days-1":"Tuesday","time-1":"5:45-6:45 pm","cost-1":"40","date-2":"2/2-2/23","days-2":"Tuesday","time-2":"5:45-6:45 pm","cost-2":"40","date-3":"3/1-3/29","days-3":"Tuesday","time-3":"5:45-6:45 pm","cost-3":"50"},{"class-name":"Parent & Child Pottery","description":"Create clay art with your kids! Kids learn different hand building terms and techniques, coil slab, pinch pot, etc. We will also make and decorate pots, cups, bowls, and plates on a pottery wheel.","category":"visual arts and crafts","age":"3-6","age-category":"tots","instructor":"Jocelyn Yee","img":"parent-child-pottery.png","date-1":"1/21-2/18","days-1":"Thursday","time-1":"10-11 am","cost-1":"80","date-2":"2/25-3/24","days-2":"Thursday","time-2":"10-11am","cost-2":"80"},{"class-name":"Pre-Ballet","description":"This class engages your child’s imagination while creating a focused container for their energy and enthusiasm. Motor skills and musicality are emphasized through games, exercises, and mini performances inside the classroom. An elementary ballet vocabulary will be used as a language for movement, as well as phrases and key words from other dance mediums. Students should wear close fitting clothes with ballet slippers or bare feet and have their hair pulled out of the face.","category":"performing arts and dance","age":"5-10","age-category":"youth","img":"pre-ballet.png","date-1":"1/17-2/14","days-1":"Saturday","time-1":"10-10:45 am","cost-1":"60","date-2":"2/21-3/21","days-2":"Saturday","time-2":"10-10:45 am","cost-2":"60"},{"class-name":"Senior Pottery","description":"Explore your creativity with clay media using hand-building and wheel-based techniques. Students will make hand build slab vases, teapots sets, press mold, imprinting boxes, along with painting with slip, carving, and inlay design. They will also keep throwing on the pottery wheels to make dinner ware like bowl, plate, saucer, pitcher, sugar jar with lid, etc. No experience needed. Just come to exercise your imagination through the art making process. Student will each receive a free bag of clay and access to studio during the quarter. Sign up early.","category":"visual arts and crafts","age":"50 +","age-category":"seniors","instructor":"Jocelyn Yee","img":"senior-pottery.png","date-1":"1/19-3/8","days-1":"Tuesday","time-1":"10-12:30 pm","cost-1":"195"},{"class-name":"Slow Floor Yoga","description":"Uniting breath with synchronized movements, this vinyasa style class weaves each pose into the next mindfully and with ease. Students will learn to use their breath to flow from one pose to the next safely and with awareness. Introduction to backbends, balancing postures, and inversions will enhance this well rounded class, allowing students to explore the depths of their practice in a supportive, non-competitive environment. Final rest and relaxation encourages rejuvenation and enhances a sense of calm and clarity for students to bring with them throughout their day. All levels welcome. Limited mats and props provided. Students are encouraged to bring a mat, blanket, and water bottle.","category":"fitness health and wellness","age":"18+","age-category":"adults","instructor":"Natalie Phillips","img":"floor-yoga.png","date-1":"1/14-2/11","days-1":"Thursday","time-1":"11:30 am-12:30 pm","cost-1":"55","date-2":"2/18-3/17","days-2":"Thursday","time-2":"11:30 am-12:30 pm","cost-2":"55"},{"class-name":"Stand Strong, Be Balanced!","description":"Get moving in one of our many fitness classes, including but not limited to boot camps, weight lifting, Intro to personal fitness, circuit training and a variety of dance fitness courses. Learn how to improve balance in this comprehensive eight week falls-prevention program. Each class includes an informative talk, lively group discussion and light strengthening exercises. Come in comfortable clothing ready to take notes. Instructor: Lisa Steubing. 8-CLASS SESSION. 1/4 - 2/29. No class 1/18, 2/15. Class location: Village Cove, 6850 Woodlawn Ave NE, 98115","category":"fitness health and wellness","age":"50+","age-category":"seniors","instructor":"Ramona Stephens","img":"senior-fitness.png","date-1":"1/4-1/26","days-1":"Monday","time-1":"7-8 pm","cost-1":"12","date-2":"2/1-2/22","days-2":"Monday","time-2":"7-8 pm","cost-2":"12","date-3":"3/1-3/28","days-3":"Monday","time-3":"7-8 pm","cost-3":"16"},{"class-name":"Tai Chi","description":"Learn the Yang style of Tai Chi using slow, soft, and circular movements to harmonize body and mind. Often described as moving meditation this practice promotes balance, concentration, and relaxation. Wear loose comfortable clothing. No class 1/18, 2/15.","category":"fitness health and wellness","age":"18+","age-category":"adults","instructor":"Brandon Murray","img":"tai-chi.png","date-1":"1/4-1/26","days-1":"Monday","time-1":"7-8 pm","cost-1":"12","date-2":"2/1-2/22","days-2":"Monday","time-2":"7-8 pm","cost-2":"12","date-3":"3/1-3/28","days-3":"Monday","time-3":"7-8 pm","cost-3":"16"},{"class-name":"Youth Pottery","description":"Explore your creativity with clay media using hand-building and wheel-based techniques. In this program, students will learn how to throw bowels, mugs, and plates on pottery wheels. They will also make animal sculptures, coil vases, clay whistles, masks, etc. Students will explore different surface decoration techniques such as graffito, carving, and painting with slip to finish their clay projects.","category":"visual arts and crafts","age":"6-12","age-category":"teens","instructor":"Jocelyn Yee","img":"youth-pottery.png","date-1":"1/13-2/10","days-1":"Wednesday","time-1":"5:15-6:45 pm","cost-1":"60","date-2":"2/17-3/16","days-2":"Wednesday","time-2":"5:15-6:45 pm","cost-2":"60"},{"class-name":"Youth Table Tennis Class","description":"Come sign up for a super fun game of table tennis. Learn effective strokes, serve and return of serve, along with footwork. Program is taught by Javier Fletcher and friends and runs 1.5 hours each day after which participants can then stay for an additional 1.5 hours of open play.","category":"athletics instruction","age":"7-16","age-category":"teens","instructor":"Javier Fletcher","img":"youth-table-tennis.png","date-1":"1/19-1/30","days-1":"Saturday","time-1":"5:15-6:45 pm","cost-1":"12","date-2":"2/6-2/27","days-2":"Saturday","time-2":"5:15-6:45 pm","cost-2":"12","date-3":"3/5-3/26","days-3":"Saturday","time-3":"5:15-6:45 pm","cost-3":"12"},{"class-name":"Zumba® Class for Kids","description":"This class is perfect for our younger Zumba® fans! Kids 7 through 9 years old get the chance to socialize with friends and jam out to their favorite music. Zumba® Kids, classes are rocking, high-energy dance parties packed with kid-friendly routines. Kids are encouraged to develop an active life style and jam out to their favorite music. Zumba® Kids classes feature kid-friendly routines, based on original Zumba® choreography. During this class the instructor will break down steps, add games, activities, and cultural exploration elements into the class structure. Please wear comfortable clothing, tennis shoes and bring your own water bottle.","category":"performing arts and dance","age":"7-9","age-category":"youth","instructor":"Ana Andrews","img":"zumba-kids.png","date-1":"1/16-3/19","days-1":"Saturday","time-1":"1-2 pm","cost-1":"75"},{"class-name":"Zy Quigong","description":"Come join Lydia Neal and Sarah Porter, certified qigong instructors as they teach one of the worlds’ most ancient and complete healing and self-development systems. Learn to: activate your energy center and system; absorb, generate, and move energy; increase your energy level and vitality; reach a deep relaxed state; balance and improve your immune and digestive systems and feel more present with your daily life.","category":"fitness health and wellness","age":"14+","age-category":"teens","instructor":"Lydia Neal and Sarah Porter","img":"zy-quigong.png","date-1":"1/13-2/10","days-1":"Wednesday","time-1":"5:15-6:45 pm","cost-1":"60","date-2":"2/17-3/16","days-2":"Wednesday","time-2":"5:15-6:45 pm","cost-2":"60"}]