[{"first-name":"Jocelyn","last-name":"Yee","full-name":"Jocelyn Yee","bio":"Jocelyn began her creative adventures as a 2-D fine artist, moving on to earn a BFA degree in Graphic Design from UW before she discovered ceramics in 2000. On a whim she signed up for a pottery class at Ballard Community Center and has been practicing her craft ever since. She has been teaching at Greenlake CC since 2012.","email":"jocelyn.yee@gcc.org","photo":"female"},{"first-name":"Natalie","last-name":"Phillips","full-name":"Natalie Phillips","bio":"Natalie has enjoyed teaching at GCC since 1999. She has completed comprehensive training in both the Iyengar and Anusara styles of yoga and her teaching also reflects her study of several spiritual traditions. In 2009, Meg was a graduate of the first Mindfulness Yoga and Meditation Training at Spirit Rock Meditation Center, CA. Compassionate mindfulness is a prominent aspect of her yoga classes.","email":"natalie.phillips@gcc.org","photo":"female"},{"first-name":"Brandon","last-name":"Murray","full-name":"Brandon Murray","bio":"A martial artist since childhood, Brandon has spent time training in Kung Fu, Hapkido, and Ju-Jitsu before coming across Tai Chi around 22 years of age. He has since spent over a year training with his instructor (Glenn Skotdal) at Meridian Tai Chi. Brandon's instructor has deemed his skills considerable enough to represent his particular form of the Chen Man-Ching Yang Style, and as such Brandon is pleased and excited for this opportunity to engage and inform other potential practitioners in this rather enjoyable and peaceful art.","email":"brandon.murray@gcc.org","photo":"male"},{"first-name":"Lydia","last-name":"Neal","full-name":"Lydia Neal","bio":"A cultural anthropologist, writer, certified qigong instructor and wilderness expedition leader, Lydia is fluent in Mandarin Chinese and holds a Masters in Public Health from UC Berkeley. She is a private student of ZY Qigong Grandmaster Xu Mingtang and has studied intensively with him at Shaolin Monastery in China and has traveled with him worldwide.","email":"lydia.neal@gcc.org","photo":"female"},{"first-name":"Sarah","last-name":"Porter","full-name":"Sarah Porter","bio":"Sarah has been studying Qigong since 2000, training with Grandmaster Mingtang Xu as a personal student, and with Claire Johnson, both of the ZY Qigong lineage.  She also studies Taoist Medicine, Tui Na and Qigong with Dr. Liu Dong and Master Liu He of Ling Gui Qigong School. A Level 1 ZY Qigong instructor since 2005 and Level 2 since 2013, Sarah teaches regularly in the Seattle area, and has developed and led several “Hiking Qigong” adventures combining Qigong practice with trail hiking in the forests and mountains of Puget Sound.","email":"srah.porter@gcc.org","photo":"female"},{"first-name":"Avery","last-name":"Douglas","full-name":"Avery Douglas","bio":"Avery has shared over 40 years of teaching, performing, and choreographing the Pacific Dance Arts locally and globally. Her love for Hawaiian hula, Tahitian dance, and New Zealand Maori haka impacts those who see the many performance groups she has directed and produced in her lifetime.","email":"avery.douglas@gcc.org","photo":"female"},{"first-name":"Ramona","last-name":"Stephens","full-name":"Ramona Stephens","bio":"Ramona has been involved in the fitness and rehabilitation for over 20 years and has a specialized background in physical therapy/injury rehabilitation as well as extensive knowledge in Sports Medicine. Ramona focuses on injury prevention through body awareness, core strength, and coordination.","email":"ramona.stephens@gcc.org","photo":"female"},{"first-name":"Javier","last-name":"Fletcher","full-name":"Javier Fletcher","bio":"Javier is a 10 year table tennis club player, highest rating about 1800. He was the Greenlake Table Tennins coach for the Sunday 4pm class from 10/2004 to 12/2007, and has volunteered to coach kids on Saturdays since January 2009. Javier gets a lot of positive comments for his ability to explain things and help his students understand what they can do to progress.","email":"javier.fletcher@gcc.org","photo":"male"},{"first-name":"Ana","last-name":"Andrews","full-name":"Ana Andrews","bio":"Ana is anative of Argentina and grew up with the joy of dancing Ballroom Tango, Cumbia and Salsa. Her love for Zumba Fitness began when she moved to Seattle and discover she could share all these exiting mix of rhythms from Latin America in just one class.","email":"ana.andrews@gcc.org","photo":"female"}]